In [6]:
import pandas as pd # data frame opertation
import numpy as np # math operations
import matplotlib.pyplot as plt # diagrams/plots
import seaborn as sns # diagrams/plots

In [7]:
# path
#file location+filename+fileextension
path=r"C:\Users\Jayanth\Data science\python sheets\Visadataset.csv"

In [8]:
pd.read_csv(path)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [ ]:
create data frame using list

In [8]:
name=['ramesh','suresh','satish']
age=[30,35,40]
name,age

(['ramesh', 'suresh', 'satish'], [30, 35, 40])

In [10]:
pd.DataFrame() # make the data frame

Empty DataFrame
Columns: []
Index: []

In [12]:
pd.DataFrame(zip(name,age))

        0   1
0  ramesh  30
1  suresh  35
2  satish  40

In [16]:
#provide coloumns
data=zip(name,age)
cols=['Name','Age']
pd.DataFrame(data,columns=cols)
#pd.DataFrame(zip(name,age),coloumns=['names','age'])

     Name  Age
0  ramesh   30
1  suresh   35
2  satish   40

**provide index**

In [17]:
data=zip(name,age)
cols=['Name','Age']
ind=['A','B','C']
pd.DataFrame(data,
             columns=cols,
            index=ind)

     Name  Age
A  ramesh   30
B  suresh   35
C  satish   40

**step-5**
$add$ $new$ $coloumn$

In [19]:
name=['ramesh','suresh','satish']
age=[30,35,40]

data=zip(name,age)
cols=['Name','Age']
ind=['A','B','C']

df=pd.DataFrame(data,columns=cols,index=ind)
df

     Name  Age
A  ramesh   30
B  suresh   35
C  satish   40

- if you want to add a new coloumn
- df['new coloumn']
- you need to have a list which is having some elements
- that elements need to equal to number of rows
- city_names=['hyd','blr','chennai']
- df['city']=city_names

In [20]:
city_names=['hyd','blr','chennai']
df['city']=city_names
df

     Name  Age     city
A  ramesh   30      hyd
B  suresh   35      blr
C  satish   40  chennai

**step-6**
$update$ $the$ $exsisting$ $coloumn$

- if you want to create the new coloumn or update the old coloumn
- both are same way

In [21]:
df['Name']=['swamy','asif','sathwik']
df

      Name  Age     city
A    swamy   30      hyd
B     asif   35      blr
C  sathwik   40  chennai

**step-7**
$drop$ $the$ $coloumn$

- in orderbto drop the coloumn 
- we need to use drop method
- it takes 3 parameteres
    - drop the coloumn or row
    - mention the coloumn name
    - axis
       - axis=1 reference as coloumn
       - axis=0 reference as row
    -you want to create a new data frame or
    - you want to over write the existing data frame
         - inplace=True

In [28]:
df.drop('city',
        axis=1,
       inplace=True)

In [29]:
df

      Name  Age
A    swamy   30
B     asif   35
C  sathwik   40

**step-8**
$Drop$ $rows$

In [30]:
df.drop('A',
        axis=0,
       inplace=True)

In [31]:
df

      Name  Age
B     asif   35
C  sathwik   40

**step-9**
$save$ $the$ $data$ $frame$

In [32]:
df.to_csv("output.csv")
#df.to_excel("output.xls")
# while saving index consider as extra coloumn

In [33]:
# read output csv
pd.read_csv("output.csv")

  Unnamed: 0     Name  Age
0          B     asif   35
1          C  sathwik   40

**step-10**
$remove$ $index$

In [34]:
# to avoid the above problem
# give index=False
df.to_csv("output.csv",index=False)

In [35]:
# read output csv
pd.read_csv("output.csv")

      Name  Age
0     asif   35
1  sathwik   40

**create data frames using dictionary**

In [38]:
d1={"Name":['Ramesh','suresh','satish']
    "Age":[30,35,40]}
pd.DataFrame(d1)

SyntaxError: invalid syntax. Perhaps you forgot a comma? (1150586515.py, line 1)